# SQL Social-Network Query Exercises

**This is a series of exercises from the [SQL](https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/about) portion of [Stanford's Databases MOOC](https://lagunita.stanford.edu/courses/DB/2014/SelfPaced/about).**

Students at your hometown high school have decided to organize their social network using databases. So far, they have collected information about sixteen students in four grades, 9-12. Here's the schema: 

Highschooler ( ID, name, grade ) 
English: There is a high school student with unique _ID_ and a given _first name_ in a certain _grade_.

Friend ( ID1, ID2 ) 
English: The student with _ID1_ is friends with the student with _ID2_. Friendship is mutual, so if (123, 456) is in the Friend table, so is (456, 123). 

Likes ( ID1, ID2 ) 
English: The student with _ID1_ likes the student with _ID2_. Liking someone is not necessarily mutual, so if (123, 456) is in the Likes table, there is no guarantee that (456, 123) is also present. 

Your queries will run over a small data set conforming to the schema. [View the database](https://lagunita.stanford.edu/c4x/DB/SQL/asset/socialdata.html). (You can also [download the schema and data](https://s3-us-west-2.amazonaws.com/prod-c2g/db/Winter2013/files/social.sql).)

**Notes:**
- I'm using PostgreSQL
- I've combined the "regular" and "extra" questions

For your convenience, here is a graph showing the various connections between the students in our database. 9th graders are blue, 10th graders are green, 11th graders are yellow, and 12th graders are purple. Undirected black edges indicate friendships, and directed red edges indicate that one student likes another student.

![title](https://lagunita.stanford.edu/c4x/DB/SQL/asset/social.png)

In [1]:
%load_ext sql

In [2]:
%%sql
postgresql://kbammarito@localhost:5432/kbammarito

'Connected: kbammarito@kbammarito'

## Create the schema for the tables

In [3]:
%%sql
create table highschooler(ID int, name text, grade int);
create table friend(ID1 int, ID2 int);
create table likes(ID1 int, ID2 int);

Done.
Done.
Done.

[]

## Populate the tables with the data

In [4]:
%%sql
insert into highschooler values (1510, 'Jordan', 9);
insert into highschooler values (1689, 'Gabriel', 9);
insert into highschooler values (1381, 'Tiffany', 9);
insert into highschooler values (1709, 'Cassandra', 9);
insert into highschooler values (1101, 'Haley', 10);
insert into highschooler values (1782, 'Andrew', 10);
insert into highschooler values (1468, 'Kris', 10);
insert into highschooler values (1641, 'Brittany', 10);
insert into highschooler values (1247, 'Alexis', 11);
insert into highschooler values (1316, 'Austin', 11);
insert into highschooler values (1911, 'Gabriel', 11);
insert into highschooler values (1501, 'Jessica', 11);
insert into highschooler values (1304, 'Jordan', 12);
insert into highschooler values (1025, 'John', 12);
insert into highschooler values (1934, 'Kyle', 12);
insert into highschooler values (1661, 'Logan', 12);

insert into friend values (1510, 1381);
insert into friend values (1510, 1689);
insert into friend values (1689, 1709);
insert into friend values (1381, 1247);
insert into friend values (1709, 1247);
insert into friend values (1689, 1782);
insert into friend values (1782, 1468);
insert into friend values (1782, 1316);
insert into friend values (1782, 1304);
insert into friend values (1468, 1101);
insert into friend values (1468, 1641);
insert into friend values (1101, 1641);
insert into friend values (1247, 1911);
insert into friend values (1247, 1501);
insert into friend values (1911, 1501);
insert into friend values (1501, 1934);
insert into friend values (1316, 1934);
insert into friend values (1934, 1304);
insert into friend values (1304, 1661);
insert into friend values (1661, 1025);
insert into friend select ID2, ID1 from friend;

insert into likes values(1689, 1709);
insert into likes values(1709, 1689);
insert into likes values(1782, 1709);
insert into likes values(1911, 1247);
insert into likes values(1247, 1468);
insert into likes values(1641, 1468);
insert into likes values(1316, 1304);
insert into likes values(1501, 1934);
insert into likes values(1934, 1501);
insert into likes values(1025, 1101);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
20 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## View each table

In [5]:
%%sql
select * from highschooler;

16 rows affected.

[(1510, 'Jordan', 9),
 (1689, 'Gabriel', 9),
 (1381, 'Tiffany', 9),
 (1709, 'Cassandra', 9),
 (1101, 'Haley', 10),
 (1782, 'Andrew', 10),
 (1468, 'Kris', 10),
 (1641, 'Brittany', 10),
 (1247, 'Alexis', 11),
 (1316, 'Austin', 11),
 (1911, 'Gabriel', 11),
 (1501, 'Jessica', 11),
 (1304, 'Jordan', 12),
 (1025, 'John', 12),
 (1934, 'Kyle', 12),
 (1661, 'Logan', 12)]

In [6]:
%%sql
select * from friend;

40 rows affected.

[(1510, 1381),
 (1510, 1689),
 (1689, 1709),
 (1381, 1247),
 (1709, 1247),
 (1689, 1782),
 (1782, 1468),
 (1782, 1316),
 (1782, 1304),
 (1468, 1101),
 (1468, 1641),
 (1101, 1641),
 (1247, 1911),
 (1247, 1501),
 (1911, 1501),
 (1501, 1934),
 (1316, 1934),
 (1934, 1304),
 (1304, 1661),
 (1661, 1025),
 (1381, 1510),
 (1689, 1510),
 (1709, 1689),
 (1247, 1381),
 (1247, 1709),
 (1782, 1689),
 (1468, 1782),
 (1316, 1782),
 (1304, 1782),
 (1101, 1468),
 (1641, 1468),
 (1641, 1101),
 (1911, 1247),
 (1501, 1247),
 (1501, 1911),
 (1934, 1501),
 (1934, 1316),
 (1304, 1934),
 (1661, 1304),
 (1025, 1661)]

In [7]:
%%sql
select * from likes;

10 rows affected.

[(1689, 1709),
 (1709, 1689),
 (1782, 1709),
 (1911, 1247),
 (1247, 1468),
 (1641, 1468),
 (1316, 1304),
 (1501, 1934),
 (1934, 1501),
 (1025, 1101)]

## Q1: Find the names of all students who are friends with someone named Gabriel.

In [8]:
%%sql
select name1 as gabriels_friends
from
(select id1, name1, id2, name2
    from
    (select id1, name as name1, id2
        from highschooler, friend
        where highschooler.id = friend.id1 and name != 'Gabriel') a
    join
    (select name as name2, id as id2
        from highschooler) b
    using(id2)) c
where name2 = 'Gabriel'
order by gabriels_friends;

5 rows affected.

[('Alexis',), ('Andrew',), ('Cassandra',), ('Jessica',), ('Jordan',)]

## Q2: For every student who likes someone 2 or more grades younger than themselves, return that student's name and grade, and the name and grade of the student they like.

In [9]:
%%sql
select name1, grade1, name2, grade2
from
(select id1, name1, grade1, id2, name2, grade2
    from
    (select id1, name as name1, grade as grade1, id2
        from highschooler, likes
        where highschooler.id = likes.id1) a
    join
    (select name as name2, grade as grade2, id as id2
        from highschooler) b
    using(id2)) c
where grade1 - grade2 >=2
order by name1;

1 rows affected.

[('John', 12, 'Haley', 10)]

## Q3: For every pair of students who both like each other, return the name and grade of both students. Include each pair only once, with the two names in alphabetical order.

In [10]:
%%sql
select name1, grade1, name2, grade2
from
(select L1.id1, L1.id2
    from likes L1, likes l2
    where L1.id1 = L2.id2 and L1.id2 = L2.id1) a
join
(select h1.name as name1, h1.grade as grade1, h1.id as id1, h2.name as name2, h2.grade as grade2, h2.id as id2
    from highschooler h1, highschooler h2) b using(id1, id2)
where id1 != id2 and name1 < name2;

2 rows affected.

[('Cassandra', 9, 'Gabriel', 9), ('Jessica', 11, 'Kyle', 12)]

## Q4: Find all students who do not appear in the Likes table (as a student who likes or is liked) and return their names and grades. Sort by grade, then by name within each grade.

In [11]:
%%sql
select name, grade
from highschooler
where id not in
(select id1
    from likes)
and id not in
(select id2
    from likes)
order by grade, name;

3 rows affected.

[('Jordan', 9), ('Tiffany', 9), ('Logan', 12)]

## Q5: For every situation where student A likes student B, but we have no information about whom B likes (that is, B does not appear as an ID1 in the Likes table), return A and B's names and grades.

In [12]:
%%sql
select a_name, a_grade, b_name, b_grade
from
(select id as b_id, name as b_name, grade as b_grade
    from highschooler
    where id in
    (select id2
        from likes)
    and id not in
    (select id1
        from likes)) a
join
(select id as a_id, name as a_name, grade as a_grade, id2 as b_id
    from highschooler, likes
    where id = id1) b
using(b_id)
order by a_name;

4 rows affected.

[('Alexis', 11, 'Kris', 10),
 ('Austin', 11, 'Jordan', 12),
 ('Brittany', 10, 'Kris', 10),
 ('John', 12, 'Haley', 10)]

## Q6: Find names and grades of students who only have friends in the same grade. Return the result sorted by grade, then by name within each grade.

In [13]:
%%sql
select distinct name1 as name, grade1 as grade
from
(select distinct id1, name1, grade1
    from
    (select f.id1, h1.name as name1, h1.grade as grade1, f.id2, h2.name as name2, h2.grade as grade2
        from highschooler h1, highschooler h2, friend f
        where f.id1=h1.id and f.id2=h2.id) a
    where id1 not in
    (select distinct id1
        from
        (select f.id1, h1.name as name1, h1.grade as grade1, f.id2, h2.name as name2, h2.grade as grade2
            from highschooler h1, highschooler h2, friend f
            where f.id1=h1.id and f.id2=h2.id and h1.grade != h2.grade
            order by id1, grade1, id2, grade2) b)) c
order by name, grade;

7 rows affected.

[('Brittany', 10),
 ('Gabriel', 11),
 ('Haley', 10),
 ('John', 12),
 ('Jordan', 9),
 ('Kris', 10),
 ('Logan', 12)]

## Q7: For each student A who likes a student B where the two are not friends, find if they have a friend C in common (who can introduce them!). For all such trios, return the name and grade of A, B, and C.

In [14]:
%%sql
select studentA.name as a_name, studentA.grade as a_grade,
studentB.name as b_name, studentB.grade as b_grade,
studentC.name as c_name, studentC.grade as c_grade
from highschooler studentA, highschooler studentB, highschooler studentC
where studentB.id in
(select likes.id2
    from likes
    where likes.id1 = studentA.id)
and studentB.id not in
(select friend.id2
    from friend
    where friend.id1 = studentA.id)
and studentC.ID in
(select friend.id2
    from friend
    where friend.id1 = studentA.id)
and studentC.id in
(select friend.id2
    from friend
    where friend.id1 = studentB.id)
order by a_name;

3 rows affected.

[('Andrew', 10, 'Cassandra', 9, 'Gabriel', 9),
 ('Austin', 11, 'Jordan', 12, 'Andrew', 10),
 ('Austin', 11, 'Jordan', 12, 'Kyle', 12)]

## Q8: Find the difference between the number of students in the school and the number of different first names.

In [15]:
%%sql
select count(id) - count(distinct name) as difference
from highschooler;

1 rows affected.

[(2,)]

## Q9: Find the name and grade of all students who are liked by more than one other student.

In [16]:
%%sql
select name, grade
from highschooler
where id in
(select id2
    from likes
    group by id2
    having count(*) > 1)
order by name;

2 rows affected.

[('Cassandra', 9), ('Kris', 10)]

## Q10: For every situation where student A likes student B, but student B likes a different student C, return the names and grades of A, B, and C.

In [17]:
%%sql
select studentA.name as a_name, studentA.grade as a_grade,
studentB.name as b_name, studentB.grade as b_grade,
studentC.name as c_name, studentC.grade as c_grade
from highschooler studentA, highschooler studentB, highschooler studentC
where studentB.id in
(select likes.id2
    from likes
    where likes.id1 = studentA.id)
and studentA.id not in
(select likes.id2
    from likes
    where likes.id1 = studentB.id)
and studentC.ID in
(select likes.id2
    from likes
    where likes.id1 = studentB.id)
order by a_name;

2 rows affected.

[('Andrew', 10, 'Cassandra', 9, 'Gabriel', 9),
 ('Gabriel', 11, 'Alexis', 11, 'Kris', 10)]

## Q11: Find those students for whom all of their friends are in different grades from themselves. Return the students' names and grades.

In [18]:
%%sql
select name, grade
from highschooler
except
select distinct h1.name as name1, h1.grade as grade1
from highschooler h1, highschooler h2, friend f
where f.id1=h1.id and f.id2=h2.id and h1.grade = h2.grade
order by name;

1 rows affected.

[('Austin', 11)]

## Q12: What is the average number of friends per student? (Your result should be just one number.)

In [19]:
%%sql
select avg(total)
from
(select id1, count(id2) as total
    from friend
    group by id1) a;

1 rows affected.

[(Decimal('2.5000000000000000'),)]

## Q13: Find the number of students who are either friends with Cassandra or are friends of friends of Cassandra. Do not count Cassandra, even though technically she is a friend of a friend.

In [20]:
%%sql
select count(*)
from
(select id1, name, grade, id2
    from highschooler, friend
    where id=id1
    and id not in
    (select id
        from highschooler
        where name = 'Cassandra')
    and id2 in
    (select id
        from highschooler
        where name = 'Cassandra')
    union
    select id1, name, grade, id2
    from highschooler, friend
    where id=id1
    and id not in
    (select id
        from highschooler
        where name = 'Cassandra')
    and id2 in
    (select id1
        from highschooler, friend
        where id=id1
        and id not in
        (select id
            from highschooler
            where name = 'Cassandra')
        and id2 in
        (select id
            from highschooler
            where name = 'Cassandra'))) a;

1 rows affected.

[(7,)]

## Q14: Find the name and grade of the student(s) with the greatest number of friends.

In [21]:
%%sql
select name, grade
from
(select id, name, grade, count(id2) as friends
    from friend, highschooler
    where id=id1
    group by id, name, grade) a
where friends >= all
(select count(id2)
    from friend, highschooler
    where id=id1
    group by id, name, grade)
order by name;

2 rows affected.

[('Alexis', 11), ('Andrew', 10)]

## Q15: It's time for the seniors to graduate. Remove all 12th graders from Highschooler.

### There are 16 highschoolers, which includes four 12th graders

In [22]:
%%sql
delete from highschooler
    where id in
    (select id
        from highschooler
        where grade = 12);

4 rows affected.

[]

### See that the deletion occured.

In [23]:
%%sql
select *
from highschooler
order by grade;

12 rows affected.

[(1510, 'Jordan', 9),
 (1689, 'Gabriel', 9),
 (1381, 'Tiffany', 9),
 (1709, 'Cassandra', 9),
 (1101, 'Haley', 10),
 (1782, 'Andrew', 10),
 (1468, 'Kris', 10),
 (1641, 'Brittany', 10),
 (1247, 'Alexis', 11),
 (1316, 'Austin', 11),
 (1911, 'Gabriel', 11),
 (1501, 'Jessica', 11)]

## Q16: If two students A and B are friends, and A likes B but not vice-versa, remove the Likes tuple.

### As a reminder, there are 10 Likes tuples.

In [24]:
%%sql
select * from likes;

10 rows affected.

[(1689, 1709),
 (1709, 1689),
 (1782, 1709),
 (1911, 1247),
 (1247, 1468),
 (1641, 1468),
 (1316, 1304),
 (1501, 1934),
 (1934, 1501),
 (1025, 1101)]

In [25]:
%%sql
delete from likes
    where id1 in
    (select studentA.id
        from highschooler studentA, highschooler studentB
        where studentB.id in
        (select likes.id2
            from likes
            where likes.id1 = studentA.id)
        and studentA.id not in
        (select likes.id2
            from likes
            where likes.id1 = studentB.id)
        and studentB.id in
        (select friend.id2
            from friend
            where friend.id1 = studentA.id))
    and id2 in
    (select studentB.id
        from highschooler studentA, highschooler studentB
        where studentB.id in
        (select likes.id2
            from likes
            where likes.id1 = studentA.id)
        and studentA.id not in
        (select likes.id2
            from likes
            where likes.id1 = studentB.id)
        and studentB.id in
        (select friend.id2
            from friend
            where friend.id1 = studentA.id));

2 rows affected.

[]

In [26]:
%%sql
select * from likes;

8 rows affected.

[(1689, 1709),
 (1709, 1689),
 (1782, 1709),
 (1247, 1468),
 (1316, 1304),
 (1501, 1934),
 (1934, 1501),
 (1025, 1101)]

## Q17: For all cases where A is friends with B, and B is friends with C, add a new friendship for the pair A and C. Do not add duplicate friendships, friendships that already exist, or friendships with oneself.

### As a reminder, there are 40 Friend tuples (20 friendships).

In [27]:
%%sql
select * from friend
order by id1, id2;

40 rows affected.

[(1025, 1661),
 (1101, 1468),
 (1101, 1641),
 (1247, 1381),
 (1247, 1501),
 (1247, 1709),
 (1247, 1911),
 (1304, 1661),
 (1304, 1782),
 (1304, 1934),
 (1316, 1782),
 (1316, 1934),
 (1381, 1247),
 (1381, 1510),
 (1468, 1101),
 (1468, 1641),
 (1468, 1782),
 (1501, 1247),
 (1501, 1911),
 (1501, 1934),
 (1510, 1381),
 (1510, 1689),
 (1641, 1101),
 (1641, 1468),
 (1661, 1025),
 (1661, 1304),
 (1689, 1510),
 (1689, 1709),
 (1689, 1782),
 (1709, 1247),
 (1709, 1689),
 (1782, 1304),
 (1782, 1316),
 (1782, 1468),
 (1782, 1689),
 (1911, 1247),
 (1911, 1501),
 (1934, 1304),
 (1934, 1316),
 (1934, 1501)]

### Need to add 32 Friend tuples (16 friendships).

In [28]:
%%sql
select distinct studentA.id as student_a, studentC.id as student_c
from highschooler studentA, highschooler studentB, highschooler studentC
where studentB.id in
(select friend.id2
    from friend
    where friend.id1 = studentA.id)
and studentC.id in
(select friend.id2
    from friend
    where friend.id1 = studentB.id)
and studentC.id not in
(select friend.id2
    from friend
    where friend.id1 = studentA.id)
and studentA.id not in
(select friend.id2
    from friend
    where friend.id1 = studentC.id)
and studentA.id not in
(select friend.id2
    from friend
    where friend.id1 =studentA.id)
and studentC.id not in
(select friend.id2
    from friend
    where friend.id1 = studentC.id)
and studentA.id != studentC.id
order by studentA.id, studentC.id;

32 rows affected.

[(1101, 1782),
 (1247, 1510),
 (1247, 1689),
 (1316, 1468),
 (1316, 1689),
 (1381, 1501),
 (1381, 1689),
 (1381, 1709),
 (1381, 1911),
 (1468, 1316),
 (1468, 1689),
 (1501, 1381),
 (1501, 1709),
 (1510, 1247),
 (1510, 1709),
 (1510, 1782),
 (1641, 1782),
 (1689, 1247),
 (1689, 1316),
 (1689, 1381),
 (1689, 1468),
 (1709, 1381),
 (1709, 1501),
 (1709, 1510),
 (1709, 1782),
 (1709, 1911),
 (1782, 1101),
 (1782, 1510),
 (1782, 1641),
 (1782, 1709),
 (1911, 1381),
 (1911, 1709)]

In [29]:
%%sql
insert into friend
    select distinct studentA.id, studentC.id
    from highschooler studentA, highschooler studentB, highschooler studentC
    where studentB.id in
    (select friend.id2
        from friend
        where friend.id1 = studentA.id)
    and studentC.id in
    (select friend.id2
        from friend
        where friend.id1 = studentB.id)
    and studentC.id not in
    (select friend.id2
        from friend
        where friend.id1 = studentA.id)
    and studentA.id not in
    (select friend.id2
        from friend
        where friend.id1 = studentC.id)
    and studentA.id not in
    (select friend.id2
        from friend
        where friend.id1 = studentA.id)
    and studentC.id not in
    (select friend.id2
        from friend
        where friend.id1 = studentC.id)
    and studentA.id != studentC.id;

32 rows affected.

[]

### Now there are 72 Friend tuples (36 friendships).

In [30]:
%%sql
select * from friend
order by id1, id2;

72 rows affected.

[(1025, 1661),
 (1101, 1468),
 (1101, 1641),
 (1101, 1782),
 (1247, 1381),
 (1247, 1501),
 (1247, 1510),
 (1247, 1689),
 (1247, 1709),
 (1247, 1911),
 (1304, 1661),
 (1304, 1782),
 (1304, 1934),
 (1316, 1468),
 (1316, 1689),
 (1316, 1782),
 (1316, 1934),
 (1381, 1247),
 (1381, 1501),
 (1381, 1510),
 (1381, 1689),
 (1381, 1709),
 (1381, 1911),
 (1468, 1101),
 (1468, 1316),
 (1468, 1641),
 (1468, 1689),
 (1468, 1782),
 (1501, 1247),
 (1501, 1381),
 (1501, 1709),
 (1501, 1911),
 (1501, 1934),
 (1510, 1247),
 (1510, 1381),
 (1510, 1689),
 (1510, 1709),
 (1510, 1782),
 (1641, 1101),
 (1641, 1468),
 (1641, 1782),
 (1661, 1025),
 (1661, 1304),
 (1689, 1247),
 (1689, 1316),
 (1689, 1381),
 (1689, 1468),
 (1689, 1510),
 (1689, 1709),
 (1689, 1782),
 (1709, 1247),
 (1709, 1381),
 (1709, 1501),
 (1709, 1510),
 (1709, 1689),
 (1709, 1782),
 (1709, 1911),
 (1782, 1101),
 (1782, 1304),
 (1782, 1316),
 (1782, 1468),
 (1782, 1510),
 (1782, 1641),
 (1782, 1689),
 (1782, 1709),
 (1911, 1247),
 (1911, 1381),
 (1911, 1501),
 (1911, 1709),
 (1934, 1304),
 (1934, 1316),
 (1934, 1501)]